Revit 2027 API
KeynoteTagFailures Properties
The BuiltInFailures.KeynoteTagFailures type exposes the following members.
Properties
Name | Description
KeynoteOnLinkWithDifferentKeynoteFile |  The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.
NoKeynoteAssignedToLinkedElement |  The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.
Top
See Also
Reference
BuiltInFailures.KeynoteTagFailures Class
Autodesk.Revit.DB Namespace